#+TITLE:     My Emacs config
#+AUTHOR:    Marcus Nitzschke
#+OPTIONS:   H:3 num:t toc:2 \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:t ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+HTML_HEAD_EXTRA:    <script type="text/javascript" src="http://ajax.googleapis.com/ajax/libs/jquery/1.4/jquery.min.js"></script>
#+HTML_HEAD_EXTRA:    <script type="text/javascript" src="fancybox/jquery.fancybox-1.3.4.pack.js"></script>
#+HTML_HEAD_EXTRA:    <link rel="stylesheet" href="fancybox/jquery.fancybox-1.3.4.css" type="text/css" media="screen" />
#+HTML_HEAD_EXTRA:    <link rel="stylesheet" type="text/css" href="worg.css" />
#+HTML_HEAD_EXTRA:    <link rel="stylesheet" type="text/css" href="style.css" />
* Introduction
This documentation is build by Emacs' [[http://orgmode.org/][orgmode]]. The =init.el= looks like this:
#+BEGIN_SRC emacs-lisp :results value :exports results
 (with-temp-buffer    (insert-file-contents "~/.emacs.d/init.el")    (buffer-string))
#+END_SRC

#+RESULTS:
#+begin_example
(require 'cl)
(require 'org)

(require 'cask); "~/.cask/cask.el")
(cask-initialize)
(require 'pallet)
(pallet-mode t)

(when (file-exists-p "~/.emacs.d/local.conf.el")
  (load "~/.emacs.d/local.conf.el"))

(require 'use-package)
(org-babel-load-file "~/.emacs.d/config.org")
#+end_example

That's all. The rest is done in the =config.org= and that's this document.
